# Python_Руководство_my_р2_данные
# code "p3"

# Упражнение 2. Задача множественного выбора (поиска)

# вариант 1
x = int(input('введите x '))
y = int(input('введите y '))
if x > 0 and y > 0:
    print("Первая четверть")
elif x > 0 and y < 0:
    print("Четвертая четверть")
elif y > 0:
    print("Вторая четверть")
else:
    print("Третья четверть")


# вариант 2

x = int(input('введите x '))
y = int(input('введите y '))
if x > 0:
    if y > 0:  # x > 0, y > 0
        print("Первая четверть")
    else:  # x > 0, y < 0
        print("Четвертая четверть")
else:
    if y > 0:  # x < 0, y > 0
        print("Вторая четверть")
    else:  # x < 0, y < 0
        print("Третья четверть")